
## Plan Result (prod)




<pre><code>Plan: 3 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.ccd_shared_servicebus_connection_string
  * azurerm_servicebus_subscription_rule.civil_ccd_jurisdiction_rule
  * module.servicebus-subscription-ccd-events.azurerm_servicebus_subscription.servicebus_subscription


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.ccd_shared_servicebus_connection_string will be created
  + resource "azurerm_key_vault_secret" "ccd_shared_servicebus_connection_string" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/civil-service-prod/providers/Microsoft.KeyVault/vaults/civil-prod"
      + name                    = "ccd-shared-servicebus-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_servicebus_subscription_rule.civil_ccd_jurisdiction_rule will be created
  + resource "azurerm_servicebus_subscription_rule" "civil_ccd_jurisdiction_rule" {
      + filter_type                    = "SqlFilter"
      + id                             = (known after apply)
      + name                           = "civil-ccd-event-rule-prod"
      + sql_filter                     = "jurisdiction_id IN ('CIVIL','civil')"
      + sql_filter_compatibility_level = (known after apply)
      + subscription_id                = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/hmc-shared-prod/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-prod/topics/hmc-to-cft-prod/subscriptions/hmc-to-civil-subscription-prod"
    }

  # module.servicebus-subscription-ccd-events.azurerm_servicebus_subscription.servicebus_subscription will be created
  + resource "azurerm_servicebus_subscription" "servicebus_subscription" {
      + auto_delete_on_idle                       = "P10675199DT2H48M5.4775807S"
      + batched_operations_enabled                = false
      + client_scoped_subscription_enabled        = false
      + dead_lettering_on_filter_evaluation_error = true
      + dead_lettering_on_message_expiration      = true
      + default_message_ttl                       = "P10675199DT2H48M5.4775807S"
      + id                                        = (known after apply)
      + lock_duration                             = "PT1M"
      + max_delivery_count                        = 10
      + name                                      = "civil-ccd-case-events-sub-prod"
      + requires_session                          = false
      + status                                    = "Active"
      + topic_id                                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-shared-prod/providers/Microsoft.ServiceBus/namespaces/ccd-servicebus-prod/topics/ccd-case-events-prod"
        # (2 unchanged attributes hidden)
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":5981,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->